Extensions/УВМ/InformationRegisters/ФИОФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ФИОФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
	</InformationRegister>
</MetaDataObject>

Extensions/УВМ/InformationRegisters/УВМ_Уведомления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УВМ_Уведомления</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУведомить</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УведомлениеОтправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КадровыйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Совмещение</v8:Type>
						<v8:Type>cfg:DocumentRef.БольничныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуСписком</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботу</v8:Type>
						<v8:Type>cfg:DocumentRef.УвольнениеСписком</v8:Type>
						<v8:Type>cfg:DocumentRef.КадровыйПеревод</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозобновлениеТрудовыхДоговоровКонтрактов</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратИзОтпускаПоУходуЗаРебенком</v8:Type>
						<v8:Type>cfg:DocumentRef.КадровыйПереводСписком</v8:Type>
						<v8:Type>cfg:DocumentRef.Увольнение</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтпускПоУходуЗаРебенком</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеВДругоеПодразделение</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/УВМ/InformationRegisters/КадроваяИсторияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>КадроваяИсторияСотрудников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКадровыхСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДолжностьПоШтатномуРасписанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/УВМ/InformationRegisters/МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>МестоПозицииШтатногоРасписанияВСтруктуреПредприятия</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УВМ_ДолжностьУпр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УВМ_ДолжностиУпр</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/УВМ/InformationRegisters/ИсполнителиЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ИсполнителиЗадач</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Исполнитель</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РольИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/УВМ/Catalogs/ФизическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ФизическиеЛица</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтраховойНомерПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МестоРождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>240</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИмеетНаучныеТруды</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИмеетИзобретения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаименованиеСлужебное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЛьготаПриНачисленииПособий</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОснованияФинансированияПособияФедеральнымБюджетом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтношениеКОсобойЗоне</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтношениеКОсобойЗоне</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидОсобойЗоны</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОсобойЗоныПроживанияРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПостоянноПроживалВКрыму18Марта2014Года</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Инициалы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПрименяетсяФЗ_20_2023</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Extensions/УВМ/InformationRegisters/ФИОФизическихЛиц/Ext/RecordSetModule.bsl
&После("ПриЗаписи")
Процедура УВМ_ПриЗаписи(Отказ, Замещение)
	Если Не Отказ И ЭтотОбъект.Количество() > 0 Тогда 
		Если ЗначениеЗаполнено(Константы.УВМ_ДатаНачалаРассылки.Получить()) И ЭтотОбъект[0].Период >= Константы.УВМ_ДатаНачалаРассылки.Получить() Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ 
			|	НаборЗаписей.Период,
			|	НаборЗаписей.ФизическоеЛицо,
			|	НаборЗаписей.Фамилия,
			|	НаборЗаписей.Имя,
			|	НаборЗаписей.Отчество
			|ПОМЕСТИТЬ НаборЗаписей
			|ИЗ
			|	&НаборЗаписей КАК НаборЗаписей
			|;
			|
			// 1 есть похожие
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ФИОФизическихЛиц.ФизическоеЛицо,
			|	ФИОФизическихЛиц.Период
			|ИЗ
			|	НаборЗаписей КАК НаборЗаписей
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц КАК ФИОФизическихЛиц
			|		ПО НаборЗаписей.Фамилия = ФИОФизическихЛиц.Фамилия
			|		И НаборЗаписей.Имя = ФИОФизическихЛиц.Имя
			|		И НаборЗаписей.Отчество = ФИОФизическихЛиц.Отчество
			|		И НаборЗаписей.Период <> ФИОФизическихЛиц.Период
			|;
			|
			// 2 есть отправки
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	УВМ_Уведомления.КадровыйДокумент КАК ФизическоеЛицо,
			|	УВМ_Уведомления.ДатаИзменения КАК ДатаИзменения
			|ИЗ
			|	РегистрСведений.УВМ_Уведомления КАК УВМ_Уведомления
			|ГДЕ
			|	(УВМ_Уведомления.КадровыйДокумент, УВМ_Уведомления.ДатаИзменения) В (ВЫБРАТЬ ФизическоеЛицо, Период ИЗ НаборЗаписей)
			|	И УВМ_Уведомления.УведомлениеОтправлено
			|;
			|
			// 3 данные физлица
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НаборЗаписей.ФизическоеЛицо,
			|	МАКСИМУМ(КадроваяИсторияСотрудников.Организация),
			|	МАКСИМУМ(КадроваяИсторияСотрудников.Подразделение),
			|	МАКСИМУМ(КадроваяИсторияСотрудников.Должность),
			|	МАКСИМУМ(ШтатноеРасписание.Подразделение) КАК ПодразделениеСтруктуры, 
			|	МАКСИМУМ(ШтатноеРасписание.УВМ_ДолжностьУпр) КАК УВМ_ДолжностьУпр, 
			|	МАКСИМУМ(КадроваяИсторияСотрудников.КоличествоСтавок),
			|	МАКСИМУМ(ФизическиеЛица.ДатаРождения) КАК ФизическоеЛицоДатаРождения,
			|	МАКСИМУМ(ФизическиеЛица.СтраховойНомерПФР) КАК ФизическоеЛицоСтраховойНомерПФР,
			|	МАКСИМУМ(ФИОФизическихЛицСрезПоследних.Фамилия),
			|	МАКСИМУМ(ФИОФизическихЛицСрезПоследних.Имя),
			|	МАКСИМУМ(ФИОФизическихЛицСрезПоследних.Отчество)
			|ИЗ
			|	НаборЗаписей КАК НаборЗаписей
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудников
			|		ПО НаборЗаписей.ФизическоеЛицо = КадроваяИсторияСотрудников.ФизическоеЛицо
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК ШтатноеРасписание 
			|		ПО КадроваяИсторияСотрудников.ДолжностьПоШтатномуРасписанию = ШтатноеРасписание.Позиция
			|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
			|		ПО НаборЗаписей.ФизическоеЛицо = ФизическиеЛица.Ссылка
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних(ДОБАВИТЬКДАТЕ(&НачалоПериода, ДЕНЬ, -1), ) КАК ФИОФизическихЛицСрезПоследних
			|		ПО НаборЗаписей.ФизическоеЛицо = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо
			|СГРУППИРОВАТЬ ПО
			|	НаборЗаписей.ФизическоеЛицо
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	МАКСИМУМ(КадроваяИсторияСотрудников.Организация) КАК Организация,
			|	МАКСИМУМ(ШтатноеРасписание.Подразделение) КАК ПодразделениеСтруктуры, 
			|	МАКСИМУМ(ШтатноеРасписание.УВМ_ДолжностьУпр) КАК УВМ_ДолжностьУпр 
			|ПОМЕСТИТЬ ПодразделенияФизлица	
			|ИЗ
			|	НаборЗаписей КАК НаборЗаписей
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудников
			|		ПО НаборЗаписей.ФизическоеЛицо = КадроваяИсторияСотрудников.ФизическоеЛицо
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК ШтатноеРасписание 
			|		ПО КадроваяИсторияСотрудников.ДолжностьПоШтатномуРасписанию = ШтатноеРасписание.Позиция
			|;	
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ИсполнителиЗадач.Исполнитель КАК Исполнитель,
			|	СтруктураПредприятия.Ссылка КАК Подразделение,
			|	ПодразделенияФизлица.ПодразделениеСтруктуры КАК ПодразделениеСтруктуры,
			|	ВЫБОР КОГДА СтруктураПредприятия.Ссылка = ПодразделенияФизлица.ПодразделениеСтруктуры ТОГДА Истина ИНАЧЕ Ложь КОНЕЦ КАК ЕстьПодразделение
			|ПОМЕСТИТЬ ПодразделенияИсполнителя	
			|ИЗ
			|	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
			|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктураПредприятия КАК СтруктураПредприятия
			|	по СтруктураПредприятия.Ссылка = ИсполнителиЗадач.ДополнительныйОбъектАдресации
			|	или СтруктураПредприятия.Ссылка.Родитель = ИсполнителиЗадач.ДополнительныйОбъектАдресации 
			|	или СтруктураПредприятия.Ссылка.Родитель.Родитель = ИсполнителиЗадач.ДополнительныйОбъектАдресации 
			|	или СтруктураПредприятия.Ссылка.Родитель.Родитель.Родитель = ИсполнителиЗадач.ДополнительныйОбъектАдресации 
			|	или СтруктураПредприятия.Ссылка.Родитель.Родитель.Родитель.Родитель = ИсполнителиЗадач.ДополнительныйОбъектАдресации,
			|	ПодразделенияФизлица КАК ПодразделенияФизлица
			|ГДЕ
			|	НЕ СтруктураПредприятия.Ссылка Есть NULL
			|;	
			|
			// 6 кому отправить
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ИсполнителиЗадач.Исполнитель КАК Исполнитель
			|ИЗ
			|	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
			|ГДЕ
			|	ИсполнителиЗадач.РольИсполнителя = ЗНАЧЕНИЕ(Справочник.РолиИсполнителей.ОтветственныйЗаИзменениеКадровыхДанных)
			|	И (ИсполнителиЗадач.ОсновнойОбъектАдресации = Неопределено 
			|		ИЛИ ИсполнителиЗадач.ОсновнойОбъектАдресации В (ВЫБРАТЬ Организация ИЗ ПодразделенияФизлица))
			|	И (ИсполнителиЗадач.ДополнительныйОбъектАдресации = Неопределено 
			|		ИЛИ (ИсполнителиЗадач.Исполнитель, Истина) В (ВЫБРАТЬ Исполнитель, ЕстьПодразделение ИЗ ПодразделенияИсполнителя)) 
			|"; 
			
			НаборЗаписей = ЭтотОбъект.Выгрузить();
			Запрос.УстановитьПараметр("НаборЗаписей", НаборЗаписей);
			Запрос.УстановитьПараметр("НачалоПериода", НаборЗаписей[0].Период);
			РезультатЗапроса = Запрос.ВыполнитьПакет();
			
			ВыборкаПохожие = РезультатЗапроса[1].Выбрать();
			ВыборкаОтправки = РезультатЗапроса[2].Выбрать();
			ВыборкаДанныеФизлица = РезультатЗапроса[3].Выбрать();
			Получатели = РезультатЗапроса[6].Выгрузить().ВыгрузитьКолонку("Исполнитель"); 
			Если Получатели.Количество() = 0 Тогда
				Возврат;
			КонецЕсли;	
			
			ЗаголовокСообщения = "Уведомление о кадровых изменениях";
			ТекстСообщения = "";
			Для Каждого Строка Из НаборЗаписей Цикл 
				ВыборкаПохожие.Сбросить();
				Если ВыборкаПохожие.НайтиСледующий(Строка.ФизическоеЛицо, "ФизическоеЛицо") Тогда
					Продолжить;
				КонецЕсли;
				ВыборкаОтправки.Сбросить();
				Если ВыборкаОтправки.НайтиСледующий(Строка.ФизическоеЛицо, "ФизическоеЛицо") Тогда
					Продолжить;
				КонецЕсли;	
				
				МенеджерЗаписи = РегистрыСведений.УВМ_Уведомления.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.КадровыйДокумент = Строка.ФизическоеЛицо;
				МенеджерЗаписи.ДатаУведомить = ТекущаяДата();
				МенеджерЗаписи.ДатаИзменения = Строка.Период;
				МенеджерЗаписи.УведомлениеОтправлено = Ложь;
				МенеджерЗаписи.Записать(Истина);
				
				ТекстСообщения = ТекстСообщения + " Изменение ФИО: " + Строка.ФизическоеЛицо + Символы.ПС;
				ВыборкаДанныеФизлица.Сбросить();
				Если ВыборкаДанныеФизлица.НайтиСледующий(Строка.ФизическоеЛицо, "ФизическоеЛицо") Тогда
					ТекстСообщения = ТекстСообщения + 
					СтрШаблон(НСтр("ru = ' 
					|Дата изменения 	%1
					|Организация 	%2
					|Подразделение 	%3
					|Кол-во ставок 	%4
					|Должность 	%5
					|Дата рождения	%6
					|СНИЛС	%7
					|Предыдущие ФИО	%8
					|'", ОбщегоНазначения.КодОсновногоЯзыка()), 
					Формат(Строка.Период, "ДФ=dd.MM.yyyy"),
					ВыборкаДанныеФизлица.Организация,
					ВыборкаДанныеФизлица.Подразделение,
					ВыборкаДанныеФизлица.КоличествоСтавок,
					ВыборкаДанныеФизлица.Должность,
					Формат(ВыборкаДанныеФизлица.ФизическоеЛицоДатаРождения, "ДФ=dd.MM.yyyy"),
					ВыборкаДанныеФизлица.ФизическоеЛицоСтраховойНомерПФР,
					СтрШаблон("%1 %2 %3", ВыборкаДанныеФизлица.Фамилия, ВыборкаДанныеФизлица.Имя, ВыборкаДанныеФизлица.Отчество)
					) + Символы.ПС;
				КонецЕсли;	
			КонецЦикла;
			
			Если ТекстСообщения <> "" Тогда
				УспешныйУспех = ОбменДаннымиПереопределяемый.ОтправитьУведомлениеПоEmail(Получатели, ЗаголовокСообщения, ТекстСообщения, , ТипТекстаПочтовогоСообщения.ПростойТекст); 
				Если УспешныйУспех Тогда
					Для Каждого Строка Из НаборЗаписей Цикл
						МенеджерЗаписи = РегистрыСведений.УВМ_Уведомления.СоздатьМенеджерЗаписи();
						МенеджерЗаписи.КадровыйДокумент = Строка.ФизическоеЛицо;
						МенеджерЗаписи.Прочитать(); 
						Если ЗначениеЗаполнено(МенеджерЗаписи.КадровыйДокумент) Тогда
							МенеджерЗаписи.УведомлениеОтправлено = Истина;
							МенеджерЗаписи.Записать(Истина);
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли;	
			КонецЕсли; 
			
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры
